InformationRegisters/ПЛ_СоответствиеСФронтСистемами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПЛ_СоответствиеСФронтСистемами</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ПЛ_ТипыОбъектовФронтСистем</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеВлияетНаУчетТМЦ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НоменклатураАлкоголь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиницаИзмеренияАлкоголь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаименованиеКнопки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПЛ_ТипыОбъектовФронтСистем</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФронтСистема</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПЛ_ТипыФронтСистем</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПЛ_СоответствиеСФронтСистемами/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

//<< Портал-Юг Баринов 2019.03.14 [6.2.22 Загрузка продаж из Micros\TNG]
// Добавляет запись в регистр, если записи ещё нет
//
// Параметры:
//  ТипОбъекта		 - ПланВидовХарактеристикСсылка.ПЛ_ТипыОбъектовФронтСистем - Тип объекта, для которого нужна запись о соответствии
//  ТипФронтСистемы	 - ПеречислениеСсылка.ПЛ_ТипыФронтСистем - Тип системы, для которой нужна запись о соответствии
//  Код				 - Строка - код объекта во фронт-системе
//  Наименование	 - Строка - наименование объекта во фронт-системе, может быть не указано
//
Процедура ДобавитьЗаписьДляСопоставления(ТипОбъекта, ТипФронтСистемы, Код, Наименование = "") Экспорт
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ТипОбъекта = ТипОбъекта;
	МенеджерЗаписи.ФронтСистема = ТипФронтСистемы;
	МенеджерЗаписи.Код = Код;
	
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() И НЕ (НЕ ПустаяСтрока(Наименование) И МенеджерЗаписи.НаименованиеКнопки <> Наименование) Тогда
		// Запись существует, наименование в ней такое же или оно не передано в процедуру
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи.ТипОбъекта = ТипОбъекта;
	МенеджерЗаписи.ФронтСистема = ТипФронтСистемы;
	МенеджерЗаписи.Код = Код;
	
	МенеджерЗаписи.НаименованиеКнопки = Наименование;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры //>> Портал-Юг Баринов 2019.03.14

//<< Портал-Юг, Баринов, 2019.04.03 [6.2.23 Функционал установки ссылочных типов в местах где указан код]
// Запускает заполнение ссылок в фоне
//
// Параметры:
//  ФронтСистема		 - ПеречислениеСсылка.ПЛ_ТипыФронтСистем - Фронт-система, данные из которой нужно обработать
//  ИдентификаторФормы	 - УникальныйИдентификатор - уникальный идентификатор формы, из которой запущено выполнение.
// 
// Возвращаемое значение:
//  Структура            - параметры выполнения задания. см. ДлительныеОперации.ВыполнитьВФоне  
//
Функция ЗаполнитьСсылкиПоКодамПослеЗагрузкиВФоне(ФронтСистема = Неопределено, ИдентификаторФормы = Неопределено) Экспорт
	
	ИмяПроцедуры = "РегистрыСведений.ПЛ_СоответствиеСФронтСистемами.ЗаполнитьСсылкиПоКодамПослеЗагрузки";
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторФормы);
	ПараметрыВыполнения.КлючФоновогоЗадания = "ЗаполнитьСсылкиПоКодамПослеЗагрузки";
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Заполнение загруженных данных фронт-систем по соответствию.'");
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	
	ПараметрыПроцедуры = Новый Структура("ФронтСистема", ФронтСистема);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(ИмяПроцедуры, ПараметрыПроцедуры, ПараметрыВыполнения);

КонецФункции //>> Портал-Юг, Баринов, 2019.04.03

//<< Портал-Юг, Баринов, 2019.04.01 [6.2.23 Функционал установки ссылочных типов в местах где указан код]
// Обрабатывает загруженные данные, заполняет в них ссылки из соответствий по кодам.
//
// Параметры:
//  Параметры		 - Структура - может содержать свойство "ФронтСистема"
//  АдресРезультата	 - Строка - адрес временного хранилища, в которое может быть помещен результат работы процедуры.
//
Процедура ЗаполнитьСсылкиПоКодамПослеЗагрузки(Параметры, АдресРезультата) Экспорт
	
	ФронтСистема = Неопределено;
	
	Если ТипЗнч(Параметры) = Тип("Структура") Тогда 
		Параметры.Свойство("ФронтСистема", ФронтСистема);
	КонецЕсли;	
	
	ТекстСообщения = НСтр("ru = 'Начато заполнения ссылок после загрузки данных из фронт-систем по соответствиям'");
	ЗаписьЖурналаРегистрацииСопоставленияДанных(ТекстСообщения);

	ОбработатьЧеки(ФронтСистема);
	
	ТекстСообщения = НСтр("ru = 'Завершено заполнение ссылок после загрузки данных из фронт-систем по соответствиям'");
	ЗаписьЖурналаРегистрацииСопоставленияДанных(ТекстСообщения);
			
КонецПроцедуры //>> Портал-Юг, Баринов, 2019.04.01

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//<< Портал-Юг, Баринов, 2019.04.03 [6.2.23 Функционал установки ссылочных типов в местах где указан код]
Процедура ЗаписьЖурналаРегистрацииСопоставленияДанных(Комментарий, Данные = Неопределено, ЭтоОшибка = Ложь)
	
	Уровень = ?(ЭтоОшибка, УровеньЖурналаРегистрации.Ошибка, УровеньЖурналаРегистрации.Информация);
	
	ИмяСобытия = НСтр("ru = 'Обмен данными.ПЛ_ФронтСистемы.Сопоставление данных'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
	
	ЗаписьЖурналаРегистрации(ИмяСобытия, Уровень,, Данные, Комментарий);
	
КонецПроцедуры //>> Портал-Юг, Баринов, 2019.04.03

//<< Портал-Юг, Баринов, 2019.04.01 [6.2.23 Функционал установки ссылочных типов в местах где указан код]
Процедура ОбработатьЧеки(ФронтСистема);
	
	ТекстСообщения = НСтр("ru = 'Начато заполнение ссылок в чеках общепита.'");
	ЗаписьЖурналаРегистрацииСопоставленияДанных(ТекстСообщения);
		
	Запрос = Новый Запрос;
	
	//<< Портал-Юг, Баринов, 2019.09.15 [9.32 Автоформирование характеристики для открытой цены при обработке загруженных чеков]
	ИменаСвойствХарактеристик = Новый Массив;
	ИменаСвойствХарактеристик.Добавить("ПЛ_Комментарий_ОткрытаяЦена_Характеристика");
	ИменаСвойствХарактеристик.Добавить("ПЛ_ДатаЧека_ОткрытаяЦена_Характеристика");
	ИменаСвойствХарактеристик.Добавить("ПЛ_НомерЧека_ОткрытаяЦена_Характеристика");
	ИменаСвойствХарактеристик.Добавить("ПЛ_НомерСтроки_ОткрытаяЦена_Характеристика");
	
	Запрос.УстановитьПараметр("ИменаСвойствХарактеристик", ИменаСвойствХарактеристик);
	//>> Портал-Юг, Баринов, 2019.09.15  
	
	//<< Ефимова Т.В., 30.10.2022, SD101396, доработка
    Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	//>>
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Чек.Ссылка КАК ЧекСсылка,
	|	МАКСИМУМ(ЕСТЬNULL(тчТовары.Номенклатура.АлкогольнаяПродукция, ЛОЖЬ)) КАК АлкогольнаяПродукция
	|ПОМЕСТИТЬ ОтборЧеков
	|ИЗ
	|	Документ.питДанныеПродажФронта КАК Чек
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПЛ_СтатусыОбработкиЧековОбщепита КАК СтатусыОбработкиЧеков
	|		ПО Чек.Ссылка = СтатусыОбработкиЧеков.ДокументЧек
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.питДанныеПродажФронта.Товары КАК тчТовары
	|		ПО Чек.Ссылка = тчТовары.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МАКСИМУМ(ДатыЗапретаИзменения.ДатаЗапрета) КАК ДатаЗапрета
	|		ИЗ
	|			РегистрСведений.ДатыЗапретаИзменения КАК ДатыЗапретаИзменения
	|		ГДЕ
	|			ДатыЗапретаИзменения.Пользователь = &Пользователь) КАК ДатаЗапретаИзменения
	|		ПО (ИСТИНА)
	|ГДЕ
	|	НЕ СтатусыОбработкиЧеков.СопоставлениеЗавершено
	|	И НЕ Чек.ПометкаУдаления
	|	И Чек.Дата > КОНЕЦПЕРИОДА(ДатаЗапретаИзменения.ДатаЗапрета, ДЕНЬ)
	|
	|СГРУППИРОВАТЬ ПО
	|	Чек.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЧекШапка.Ссылка КАК ЧекСсылка,
	|	ЧекШапка.ПЛ_ФронтСистема КАК ФронтСистема,
	|	ЧекШапка.ПЛ_КодТочкиПродажи КАК КассаККМКод,
	|	ЧекШапка.ПЛ_КодКарточки КАК ДисконтнаяКартаКод,
	|	ЧекШапка.ПЛ_КодСотрудника КАК ОтветственныйКод,
	|	ЧекШапка.КассаККМ КАК КассаККМ,
	|	ЧекШапка.ДисконтнаяКарта КАК ДисконтнаяКарта,
	|	ЧекШапка.Ответственный КАК Ответственный,
	|	ЧекШапка.Организация КАК Организация,
	|	ЧекШапка.Подразделение КАК Подразделение,
	|	КассыККМ.Объект КАК КассаККМСоответствие,
	|	Карточки.Объект КАК ДисконтнаяКартаСоответствие,
	|	Пользователи.Объект КАК ОтветственныйСоответствие,
	|	КассыККМСправочник.Владелец КАК ОрганизацияСоответствие,
	|	КассыККМСправочник.Подразделение КАК ПодразделениеСоответствие,
	|	ЧекШапка.КассовыйУзел КАК КассовыйУзел,
	|	КассыККМСправочник.питКассовыйУзел КАК КассовыйУзелСоответствие,
	|	КассыККМ.Объект ЕСТЬ NULL КАК КассаККМНетСоответствия,
	|	Карточки.Объект ЕСТЬ NULL КАК ДисконтнаяКартаНетСоответствия,
	|	Пользователи.Объект ЕСТЬ NULL КАК ОтветственныйНетСоответствия,
	|	ЕСТЬNULL(Карточки.НеВлияетНаУчетТМЦ, ЛОЖЬ) КАК ДисконтнаяКартаНеВлияетНаУчетТМЦ,
	|	ИСТИНА КАК ОтветственныйНеВлияетНаУчетТМЦ,
	|	ЛОЖЬ КАК КассаККМНеВлияетНаУчетТМЦ,
	|	ОтборЧеков.АлкогольнаяПродукция КАК АлкогольнаяПродукция
	|ИЗ
	|	Документ.питДанныеПродажФронта КАК ЧекШапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборЧеков КАК ОтборЧеков
	|		ПО ЧекШапка.Ссылка = ОтборЧеков.ЧекСсылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПЛ_СоответствиеСФронтСистемами КАК КассыККМ
	|		ПО ЧекШапка.ПЛ_КодТочкиПродажи = КассыККМ.Код
	|			И ЧекШапка.ПЛ_ФронтСистема = КассыККМ.ФронтСистема
	|			И (КассыККМ.ТипОбъекта = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ПЛ_ТипыОбъектовФронтСистем.КассаККМ))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПЛ_СоответствиеСФронтСистемами КАК Пользователи
	|		ПО ЧекШапка.ПЛ_КодСотрудника = Пользователи.Код
	|			И ЧекШапка.ПЛ_ФронтСистема = Пользователи.ФронтСистема
	|			И (Пользователи.ТипОбъекта = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ПЛ_ТипыОбъектовФронтСистем.Пользователь))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПЛ_СоответствиеСФронтСистемами КАК Карточки
	|		ПО ЧекШапка.ПЛ_КодКарточки = Карточки.Код
	|			И ЧекШапка.ПЛ_ФронтСистема = Карточки.ФронтСистема
	|			И (Карточки.ТипОбъекта = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ПЛ_ТипыОбъектовФронтСистем.Карточка))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КассыККМ КАК КассыККМСправочник
	|		ПО (КассыККМ.Объект = КассыККМСправочник.Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЧекШапка.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Ссылка КАК ЧекСсылка,
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	Товары.ПЛ_КодКнопки КАК НоменклатураКод,
	|	Товары.ПЛ_НаименованиеКнопки КАК НаименованиеКнопки,
	|	НоменклатураСоответствие.Объект КАК НоменклатураСоответствие,
	|	НоменклатураСоответствие.НоменклатураАлкоголь КАК НоменклатураАлкоголь,
	|	НоменклатураСоответствие.ЕдиницаИзмеренияАлкоголь КАК ЕдиницаИзмеренияАлкоголь,
	|	Товары.Ссылка.КассаККМ.Склад КАК КассаККМСклад,
	|	Товары.Ссылка.Дата КАК ДатаЧека,
	|	ВЫРАЗИТЬ(НоменклатураСоответствие.Объект КАК Справочник.Номенклатура).АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	|	ВЫРАЗИТЬ(НоменклатураСоответствие.Объект КАК Справочник.Номенклатура).СтавкаНДС КАК СтавкаНДС,
	|	ОтборЧеков.ЧекСсылка.ПЛ_ФронтСистема = ЗНАЧЕНИЕ(Перечисление.ПЛ_ТипыФронтСистем.Micros) КАК ВычислятьНДСПоСтавке,
	|	ВЫРАЗИТЬ(НоменклатураСоответствие.Объект КАК Справочник.Номенклатура).питПродажаПоСвободнойЦене КАК ПродажаПоСвободнойЦене,
	|	ВЫРАЗИТЬ(НоменклатураСоответствие.Объект КАК Справочник.Номенклатура).ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры) КАК ИспользованиеХарактеристик,
	|	НоменклатураСоответствие.Объект ЕСТЬ NULL КАК НоменклатураНетСоответствия,
	|	ЕСТЬNULL(НоменклатураСоответствие.Количество, 1) КАК Количество,
	|	НоменклатураСоответствие.Упаковка КАК Упаковка,
	|	ЕСТЬNULL(НоменклатураСоответствие.НеВлияетНаУчетТМЦ, ЛОЖЬ) КАК НеВлияетНаУчетТМЦ
	|ИЗ
	|	Документ.питДанныеПродажФронта.Товары КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборЧеков КАК ОтборЧеков
	|		ПО Товары.Ссылка = ОтборЧеков.ЧекСсылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПЛ_СоответствиеСФронтСистемами КАК НоменклатураСоответствие
	|		ПО Товары.ПЛ_КодКнопки = НоменклатураСоответствие.Код
	|			И Товары.Ссылка.ПЛ_ФронтСистема = НоменклатураСоответствие.ФронтСистема
	|			И (НоменклатураСоответствие.ТипОбъекта = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ПЛ_ТипыОбъектовФронтСистем.Номенклатура))
	|ГДЕ
	|	Товары.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки УБЫВ
	|ИТОГИ ПО
	|	ЧекСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Товары.Ссылка КАК ЧекСсылка
	|ИЗ
	|	Документ.питДанныеПродажФронта.Товары КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборЧеков КАК ОтборЧеков
	|		ПО Товары.Ссылка = ОтборЧеков.ЧекСсылка
	|ГДЕ
	|	Товары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка)
	|ИТОГИ ПО
	|	ЧекСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка,
	|	ДополнительныеРеквизитыИСведения.Имя КАК Имя
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.Имя В(&ИменаСвойствХарактеристик)";
	
	Если ЗначениеЗаполнено(ФронтСистема) Тогда
		СхемаЗапроса = Новый СхемаЗапроса;
		СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
		Отбор = СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор;
		Отбор.Добавить("Чек.ПЛ_ФронтСистема = &ФронтСистема");
		Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
      	Запрос.УстановитьПараметр("ФронтСистема", ФронтСистема);
	КонецЕсли;
	
	Результаты = Запрос.ВыполнитьПакет();
	
	ВыборкаШапка = Результаты[1].Выбрать();
	ВыборкаДокументы = Результаты[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаПустаяСтавкаНДС = Результаты[3].Выбрать();
	
	//<< Портал-Юг, Баринов, 2019.09.15 [9.32 Автоформирование характеристики для открытой цены при обработке загруженных чеков]
	СвойстваХарактеристикОткрытаяЦена = Новый Структура;
	ВыборкаСвойстваХарактеристик = Результаты[4].Выбрать();
	Пока ВыборкаСвойстваХарактеристик.Следующий() Цикл
		СвойстваХарактеристикОткрытаяЦена.Вставить(ВыборкаСвойстваХарактеристик.Имя, ВыборкаСвойстваХарактеристик.Ссылка);
	КонецЦикла;
	ЕстьНеНайденныеРеквизиты = Ложь;
	Для каждого ИмяСвойства Из ИменаСвойствХарактеристик Цикл
		Если НЕ СвойстваХарактеристикОткрытаяЦена.Свойство(ИмяСвойства) Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Не найден дополнительный реквизит характеристики с именем %1. Характеристики для открытой цены не будут сформированы.'"), ИмяСвойства);
			ЗаписьЖурналаРегистрацииСопоставленияДанных(ТекстСообщения, Неопределено, Истина);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, ЕстьНеНайденныеРеквизиты);
		КонецЕсли; 
	КонецЦикла;
	Если ЕстьНеНайденныеРеквизиты Тогда
	 	СвойстваХарактеристикОткрытаяЦена = Неопределено;
	КонецЕсли; 
	//>> Портал-Юг, Баринов, 2019.09.15
	
	НовыеЗаписиСоответствий = ТаблицаЗаписиСоответствий();
	
	ПоляШапки = Новый Структура;	
	ПоляШапки.Вставить("Ответственный",   ПланыВидовХарактеристик.ПЛ_ТипыОбъектовФронтСистем.Пользователь);
	ПоляШапки.Вставить("ДисконтнаяКарта", ПланыВидовХарактеристик.ПЛ_ТипыОбъектовФронтСистем.Карточка);
	ПоляШапки.Вставить("Организация");
	ПоляШапки.Вставить("Подразделение");
	//<< Портал-Юг, Баринов, 2019.09.14 [9.33 Уменьшение продаж на возвраты по открытой цене при формировании выпусков блюд]
	ПоляШапки.Вставить("КассовыйУзел");
	//>> Портал-Юг, Баринов, 2019.09.14  
	
	// Номенклатура обрабатывается отдельно при обходе ТЧ
	ПолеНоменклатура = Новый Структура("Ключ, Значение", "Номенклатура", ПланыВидовХарактеристик.ПЛ_ТипыОбъектовФронтСистем.Номенклатура);
	// Кассу нужно обработать отдельно в самом конце, только если все остальные поля сопоставлены успешно
	ПолеКассаККМ     = Новый Структура("Ключ, Значение", "КассаККМ", ПланыВидовХарактеристик.ПЛ_ТипыОбъектовФронтСистем.КассаККМ);	
	
	//<< Портал-Юг, Баринов, 2019.09.14 [9.32 Автоформирование характеристики для открытой цены при обработке загруженных чеков]
	НоменклатураСХарактеристиками = Новый Соответствие;
	//>> Портал-Юг, Баринов, 2019.09.14
	
	КэшированныеЗначения = Неопределено;	
		
	Пока ВыборкаШапка.Следующий() Цикл
		
		ЧекОбъект = Неопределено;
		СопоставлениеЗавершено = Истина;
		
		АлкогольнаяПродукция = ВыборкаШапка.АлкогольнаяПродукция;
		
		Для каждого Поле Из ПоляШапки Цикл
			
			ОбработатьПолеШапкиЧека(Поле, ВыборкаШапка, ЧекОбъект, СопоставлениеЗавершено, НовыеЗаписиСоответствий);
						
		КонецЦикла;
				
		ВыборкаДокументы.Сбросить();
		Если ВыборкаДокументы.НайтиСледующий(ВыборкаШапка.ЧекСсылка, "ЧекСсылка") Тогда 
			// Если без ссылок осталась только шапка, то запись в ВыборкаДокументы не будет найдена, т.к. обрабатывать нечего.
			
			//<< Портал-Юг, Баринов, 2019.09.14 [9.32 Автоформирование характеристики для открытой цены при обработке загруженных чеков]
			НоменклатураСХарактеристиками.Очистить();
			//>> Портал-Юг, Баринов, 2019.09.14
			
			ВыборкаТовары = ВыборкаДокументы.Выбрать();
			Пока ВыборкаТовары.Следующий() Цикл
				
				ЗначениеСоответствия = ВыборкаТовары.НоменклатураСоответствие;
				Если ЗначениеЗаполнено(ВыборкаТовары.НоменклатураСоответствие) ИЛИ ЗначениеЗаполнено(ВыборкаТовары.НоменклатураАлкоголь) Тогда
					ЧекОбъект = ЧекОбъект(ВыборкаШапка.ЧекСсылка, ЧекОбъект);
					СтрокаТовары = ЧекОбъект.Товары[ВыборкаТовары.НомерСтроки - 1];

					//>>Швецов. 11.12.2024 Розничные продажи алкоголя. 
					//АлкогольнаяПродукция = АлкогольнаяПродукция ИЛИ ВыборкаТовары.АлкогольнаяПродукция;
					ИспользуетсяСерийная = Ложь;
					
					//Швецов. Для поддержки переходного периода
					НаменклатураАлкоголь = ?(ЗначениеЗаполнено(ВыборкаТовары.НоменклатураСоответствие) И ВыборкаТовары.НоменклатураСоответствие.АлкогольнаяПродукцияВоВскрытойТаре, ВыборкаТовары.НоменклатураСоответствие,
										   ?(ЗначениеЗаполнено(ВыборкаТовары.НоменклатураАлкоголь) И ВыборкаТовары.НоменклатураАлкоголь.АлкогольнаяПродукция, ВыборкаТовары.НоменклатураАлкоголь, Справочники.Номенклатура.ПустаяСсылка())); 	
					
					Если НаменклатураАлкоголь <> Справочники.Номенклатура.ПустаяСсылка() и НЕ НаменклатураАлкоголь.АлкогольнаяПродукцияВоВскрытойТаре Тогда
						
						РезультатОстатков = MRS_ЗагрузкаЕГАИСФронт.ПолучитьОстаткиВскрытойПродукции(ВыборкаТовары.НоменклатураСоответствие, ВыборкаТовары.КассаККМСклад, ВыборкаТовары.ДатаЧека);
						
						Пока РезультатОстатков.Следующий() Цикл
							
							Если РезультатОстатков.ВНаличииОстаток <> 0 Тогда
								
								СтрокаТовары.Номенклатура = ВыборкаТовары.НоменклатураСоответствие;

							Иначе
								
								СтрокаТовары.Номенклатура = ВыборкаТовары.НоменклатураАлкоголь;

								ИспользуетсяСерийная = Истина; 
								
								КоличествоУпаковок = ВыборкаТовары.Количество;
								
								Если ЗначениеЗаполнено(ВыборкаТовары.ЕдиницаИзмеренияАлкоголь) Тогда
									
									УпаковкиАлкоголь = ВыборкаТовары.ЕдиницаИзмеренияАлкоголь;
									
								Иначе 	
									
									УпаковкиАлкоголь = ВыборкаТовары.НоменклатураАлкоголь.ОбъемЕдиницаИзмерения; 	
									
								КонецЕсли;
								
							КонецЕсли;	
							
						КонецЦикла;
						
					Иначе
						
						СтрокаТовары.Номенклатура = ВыборкаТовары.НоменклатураСоответствие;		
						// Количество
						КоличествоУпаковок = СтрокаТовары.КоличествоУпаковок * ВыборкаТовары.Количество;

					КонецЕсли;	
										
					СтруктураДействийСтрокаТовары = Новый Структура;					
										
					//Швецов. 11.12.2024. Особенности пересчета в чеках по алкоголю
					Если ИспользуетсяСерийная Тогда
						
						СтрокаТовары.Упаковка = УпаковкиАлкоголь;	
						СтрокаТовары.КоличествоУпаковок = КоличествоУпаковок;
						СтрокаТовары.Количество = КоличествоУпаковок*Справочники.УпаковкиЕдиницыИзмерения.КоэффициентУпаковки(УпаковкиАлкоголь,ВыборкаТовары.НоменклатураАлкоголь);
						
					Иначе	
						Если КоличествоУпаковок <> 0 И КоличествоУпаковок <> СтрокаТовары.КоличествоУпаковок Тогда
							СтрокаТовары.КоличествоУпаковок = КоличествоУпаковок;
							СтруктураДействийСтрокаТовары.Вставить("ПересчитатьКоличествоЕдиницСуффикс");
							СтруктураДействийСтрокаТовары.Вставить("ПересчитатьЦенуПоСумме");
						КонецЕсли;
					
						// Упаковка
						Если СтрокаТовары.Упаковка <> ВыборкаТовары.Упаковка Тогда
							СтрокаТовары.Упаковка = ВыборкаТовары.Упаковка;
							СтруктураДействийСтрокаТовары.Вставить("ПересчитатьКоличествоЕдиницСуффикс");
						КонецЕсли;
										
						Если СтруктураДействийСтрокаТовары.Количество() Тогда
							// Пересчёт строки после изменения упаковки и количества упаковок
							ОбработкаТабличнойЧастиВызовСервера.ОбработатьСтрокуТЧ(СтрокаТовары, СтруктураДействийСтрокаТовары, КэшированныеЗначения);
						КонецЕсли;
						
					КонецЕсли;
					//<<Швецов. Розничные продажи алкоголя.
					
					//<< Портал-Юг, Баринов, 2019.09.12 [6.2.20 Загрузка продаж из Micros]
					// НДС
					Если ВыборкаТовары.ВычислятьНДСПоСтавке Тогда
						СтрокаТовары.СтавкаНДС = ВыборкаТовары.СтавкаНДС;
						РассчитатьСуммуНДСТабЧастиЧека(СтрокаТовары, ЧекОбъект.СуммаВключаетНДС);												
					КонецЕсли; 
					//>> Портал-Юг, Баринов, 2019.09.12
					
					//<< Портал-Юг, Баринов, 2019.09.14 [9.32 Автоформирование характеристики для открытой цены при обработке загруженных чеков]
					//<<Швецов. Розничные продажи алкоголя.
					Если ЗначениеЗаполнено(ВыборкаТовары.ПродажаПоСвободнойЦене) И ЗначениеЗаполнено(ВыборкаТовары.ИспользованиеХарактеристик) Тогда
						Если ВыборкаТовары.ПродажаПоСвободнойЦене И ВыборкаТовары.ИспользованиеХарактеристик Тогда 
							НоменклатураСХарактеристиками.Вставить(СтрокаТовары.Номенклатура);
						КонецЕсли;	
						//>> Портал-Юг, Баринов, 2019.09.14
						
						//<< Портал-Юг, Баринов, 2019.08.26 [9.09. Обособление продаж по открытой цене]
						// Открытая цена не должна сворачиваться нигде. Количество в строке должно быть равно 1.
						Если ВыборкаТовары.ПродажаПоСвободнойЦене И СтрокаТовары.КоличествоУпаковок > 1 Тогда
							
							ОсталосьКоличество = СтрокаТовары.КоличествоУпаковок - 1;
							СтрокаТовары.КоличествоУпаковок = 1;
							СтруктураДействийСтрокаТовары = Новый Структура;
							СтруктураДействийСтрокаТовары.Вставить("ПересчитатьСумму");
							Если ЗначениеЗаполнено(СтрокаТовары.Упаковка) Тогда
								СтруктураДействийСтрокаТовары.Вставить("ПересчитатьКоличествоЕдиницСуффикс");
							Иначе
								СтрокаТовары.Количество = СтрокаТовары.КоличествоУпаковок;						
							КонецЕсли;
							ОбработкаТабличнойЧастиВызовСервера.ОбработатьСтрокуТЧ(СтрокаТовары, СтруктураДействийСтрокаТовары, КэшированныеЗначения);
							
							СтрокаТовары.СуммаСкидки = Окр(СтрокаТовары.Сумма * СтрокаТовары.ПроцентСкидки / 100,2);
							СтрокаТовары.СуммаСкидкиСтроки = Окр(СтрокаТовары.Сумма * СтрокаТовары.ПроцентСкидкиСтроки / 100,2);
							РассчитатьСуммуНДСТабЧастиЧека(СтрокаТовары, ЧекОбъект.СуммаВключаетНДС);
							
							Пока ОсталосьКоличество > 0 Цикл
							 	ЗаполнитьЗначенияСвойств(ЧекОбъект.Товары.Добавить(), СтрокаТовары,, "НомерСтроки");
								ОсталосьКоличество = ОсталосьКоличество - 1;
							КонецЦикла;						
						
						КонецЕсли;
					КонецЕсли;
					//<<Швецов. Розничные продажи алкоголя.
					//>> Портал-Юг, Баринов, 2019.08.26
	            ИначеЕсли ВыборкаТовары.НеВлияетНаУчетТМЦ Тогда 
					// Строка не отражает движения товаров. Например, "Сообщение кухне".
					// Сразу удаляем строки, т.к. запросом они упорядочены по убыванию номеров.
					ЧекОбъект = ЧекОбъект(ВыборкаШапка.ЧекСсылка, ЧекОбъект);
					ЧекОбъект.Товары.Удалить(ВыборкаТовары.НомерСтроки - 1);
				Иначе
					СопоставлениеЗавершено = Ложь;
				КонецЕсли;
				
				ПроверитьЗаписьСоответствия(ПолеНоменклатура, ВыборкаТовары, НовыеЗаписиСоответствий, ВыборкаШапка.ФронтСистема);
				
			КонецЦикла;	// ВыборкаТовары.Следующий()
			
			//<< Портал-Юг, Баринов, 2019.09.14 [9.32 Автоформирование характеристики для открытой цены при обработке загруженных чеков]
			ДозаполнитьХарактеристикиДляОткрытойЦены(ЧекОбъект, НоменклатураСХарактеристиками, СвойстваХарактеристикОткрытаяЦена);
			//>> Портал-Юг, Баринов, 2019.09.14
			
		КонецЕсли;	
		
		ВыборкаПустаяСтавкаНДС.Сбросить();
		Если ВыборкаПустаяСтавкаНДС.НайтиСледующий(ВыборкаШапка.ЧекСсылка, "ЧекСсылка") Тогда 
			// Пустая ставка НДС оставаться не должна, с пустой ставкой и выпуск блюд не сформируется.
			// Это не обработанный чек, нужно выяснять почему ставка не рассчиталась.
			СопоставлениеЗавершено = Ложь;
		КонецЕсли;		
		
		Если СопоставлениеЗавершено Тогда
			// Все поля сопоставлены успешно, можно и кассу заполнить.
			// Иначе намеренно не заполняем кассу чтобы чек не попал в обработку загрузки из чеков.
			ОбработатьПолеШапкиЧека(ПолеКассаККМ, ВыборкаШапка, ЧекОбъект, СопоставлениеЗавершено, НовыеЗаписиСоответствий);
		КонецЕсли;	
		
		Если ЧекОбъект <> Неопределено Тогда 
			Если ЧекОбъект.Товары.Количество() = 0 Тогда
				// Табличная часть пуста, дальше обрабатывать нечего.
				// Намеренно не заполняем кассу чтобы чек не попал в обработку загрузки из чеков.
				ЧекОбъект.КассаККМ = Неопределено;
			КонецЕсли; 
			// Внесены изменения в документ, его нужно записать			
			Если СопоставлениеЗавершено Тогда
				ЧекОбъект.ДополнительныеСвойства.Вставить("ПЛ_СопоставлениеЗавершено", Истина);
				Если НЕ АлкогольнаяПродукция Тогда 
					ЧекОбъект.ДополнительныеСвойства.Вставить("ПЛ_ОбработкаЕГАИСЗавершена", Истина);					
				КонецЕсли;	
			КонецЕсли;	
			ЧекОбъект.ОбменДанными.Загрузка = Истина;
			Попытка
				// Обработаем максимально возможное количество документов.
				ЧекОбъект.Записать();
			Исключение
				ИнформацияОбОшибке = ИнформацияОбОшибке();
				ЗаписьЖурналаРегистрацииСопоставленияДанных(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке), ЧекОбъект, Истина);				
				ТекстСообщения = НСтр("ru = 'Не удалось записать документ %1'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ЧекОбъект);
				ТекстСообщения = ТекстСообщения + " " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЧекОбъект.Ссылка);
			КонецПопытки;	
		КонецЕсли;	
		
	КонецЦикла;
	
	ДобавитьЗаписи(НовыеЗаписиСоответствий);
	
	ТекстСообщения = НСтр("ru = 'Завершено заполнение ссылок в чеках общепита.'");
	ЗаписьЖурналаРегистрацииСопоставленияДанных(ТекстСообщения);
	
КонецПроцедуры //>> Портал-Юг, Баринов, 2019.04.01

//<< Портал-Юг, Баринов, 2019.04.02 [6.2.23 Функционал установки ссылочных типов в местах где указан код]
Функция ЧекОбъект(ЧекСсылка, ЧекОбъект)

	Если ЧекОбъект = Неопределено Тогда 
		ЧекОбъект = ЧекСсылка.ПолучитьОбъект();
	КонецЕсли;

	Возврат ЧекОбъект;
	
КонецФункции //>> Портал-Юг, Баринов, 2019.04.02

//<< Портал-Юг, Баринов, 2019.04.02 [6.2.23 Функционал установки ссылочных типов в местах где указан код]
Функция ТаблицаЗаписиСоответствий()
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Код");
	Результат.Колонки.Добавить("ФронтСистема");
	Результат.Колонки.Добавить("ТипОбъекта");

	Возврат Результат;
КонецФункции //>> Портал-Юг, Баринов, 2019.04.02

//<< Портал-Юг, Баринов, 2019.09.19 [6.2.22 Загрузка продаж из Sanatorium] + сумма скидки
Процедура РассчитатьСуммуНДСТабЧастиЧека(ДанныеСтроки, СуммаВключаетНДС) Экспорт
	
	СтруктураДанныеСтроки = Новый Структура("Сумма, СуммаСкидки, СтавкаНДС, СуммаНДС");
	ЗаполнитьЗначенияСвойств(СтруктураДанныеСтроки, ДанныеСтроки);
	ДанныеСтроки.СуммаСкидки = ДанныеСтроки.СуммаСкидки + ДанныеСтроки.СуммаСкидкиСтроки;
	питОбщегоНазначенияКлиентСервер.РассчитатьСуммуНДСТабЧасти(СтруктураДанныеСтроки, СуммаВключаетНДС);
	ДанныеСтроки.СуммаНДС = СтруктураДанныеСтроки.СуммаНДС;
	
КонецПроцедуры //>> Портал-Юг, Баринов, 2019.09.19

//<< Портал-Юг, Баринов, 2019.04.02 [6.2.23 Функционал установки ссылочных типов в местах где указан код]
Процедура ПроверитьЗаписьСоответствия(Поле, Выборка, НовыеЗаписиСоответствий, ФронтСистема = Неопределено)
	
	Если ЗначениеЗаполнено(Поле.Значение) Тогда
		Код = СокрЛП(Выборка[Поле.Ключ + "Код"]);
		Если ЗначениеЗаполнено(Код) И Выборка[Поле.Ключ + "НетСоответствия"] Тогда
			// Нет записи в регистре соответствий, создадим её
			Запись = НовыеЗаписиСоответствий.Добавить();
			Запись.Код = Код;
			Запись.ФронтСистема = ?(ЗначениеЗаполнено(ФронтСистема), ФронтСистема, Выборка.ФронтСистема);
			Запись.ТипОбъекта = Поле.Значение;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры //>> Портал-Юг, Баринов, 2019.04.02

//<< Портал-Юг, Баринов, 2019.09.14 [9.32 Автоформирование характеристики для открытой цены при обработке загруженных чеков]
Процедура ДозаполнитьХарактеристикиДляОткрытойЦены(ЧекОбъект, НоменклатураСХарактеристиками, СвойстваХарактеристикОткрытаяЦена)
	
	Если НоменклатураСХарактеристиками.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;	
	
	Если ЧекОбъект.ВидОперации <> Перечисления.питХозяйственныеОперации.ДанныеПродажФронтаПродажа Тогда
		// Для возвратов заполнение характеристики смысла не имеет и чек не считает её обязательной.
		Возврат;
	КонецЕсли;
	
	Если СвойстваХарактеристикОткрытаяЦена = Неопределено Тогда
		// Не найдены реквизиты, сообщение об ошибке выдано уже при поиске
		Возврат;
	КонецЕсли; 
	
	ДатаЧека = НачалоДня(ЧекОбъект.Дата);
	НомерЧека = ?(ЗначениеЗаполнено(ЧекОбъект.НомерЧека), ЧекОбъект.НомерЧека, ЧекОбъект.Номер); 
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Товары", ЧекОбъект.Товары.Выгрузить(, "НомерСтроки, Номенклатура"));
	Запрос.УстановитьПараметр("ДатаЧека", ДатаЧека);
	Запрос.УстановитьПараметр("НомерЧека", НомерЧека);
	Для каждого ДопРеквизит Из СвойстваХарактеристикОткрытаяЦена Цикл
		Запрос.УстановитьПараметр(ДопРеквизит.Ключ, ДопРеквизит.Значение);
	КонецЦикла; 
		
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	ВЫРАЗИТЬ(Товары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура
	|ПОМЕСТИТЬ тчТовары
	|ИЗ
	|	&Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХарактеристикаШапка.Ссылка КАК Характеристика,
	|	ХарактеристикаНомерСтроки.Значение КАК НомерСтроки,
	|	ХарактеристикаШапка.Владелец КАК Владелец
	|ПОМЕСТИТЬ спрХарактеристики
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикаШапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикаНомерСтроки
	|		ПО ХарактеристикаШапка.Ссылка = ХарактеристикаНомерСтроки.Ссылка
	|			И (ХарактеристикаНомерСтроки.Свойство = &ПЛ_НомерСтроки_ОткрытаяЦена_Характеристика)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикаНомерЧека
	|		ПО ХарактеристикаШапка.Ссылка = ХарактеристикаНомерЧека.Ссылка
	|			И (ХарактеристикаНомерЧека.Свойство = &ПЛ_НомерЧека_ОткрытаяЦена_Характеристика)
	|			И (ХарактеристикаНомерЧека.Значение = &НомерЧека)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикаДатаЧека
	|		ПО ХарактеристикаШапка.Ссылка = ХарактеристикаДатаЧека.Ссылка
	|			И (ХарактеристикаДатаЧека.Свойство = &ПЛ_ДатаЧека_ОткрытаяЦена_Характеристика)
	|			И (ХарактеристикаДатаЧека.Значение = &ДатаЧека)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тчТовары.НомерСтроки КАК НомерСтроки,
	|	тчТовары.Номенклатура КАК Номенклатура,
	|	спрХарактеристики.Характеристика КАК Характеристика
	|ИЗ
	|	тчТовары КАК тчТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ спрХарактеристики КАК спрХарактеристики
	|		ПО тчТовары.НомерСтроки = спрХарактеристики.НомерСтроки
	|			И тчТовары.Номенклатура = спрХарактеристики.Владелец
	|ГДЕ
	|	тчТовары.Номенклатура.питПродажаПоСвободнойЦене
	|	И тчТовары.Номенклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СпрМенеджер = Справочники.ХарактеристикиНоменклатуры;
	
	Пока Выборка.Следующий() Цикл
		
		Характеристика = Выборка.Характеристика;
		
		Если НЕ ЗначениеЗаполнено(Характеристика) Тогда
			
			Новая = СпрМенеджер.СоздатьЭлемент();
			Новая.Владелец = Выборка.Номенклатура;
			Новая.Заполнить(Неопределено);
			
			ДопРеквизит = Новая.ДополнительныеРеквизиты.Добавить();
			ДопРеквизит.Свойство = СвойстваХарактеристикОткрытаяЦена.ПЛ_ДатаЧека_ОткрытаяЦена_Характеристика;
			ДопРеквизит.Значение = ДатаЧека;
			
			ДопРеквизит = Новая.ДополнительныеРеквизиты.Добавить();
			ДопРеквизит.Свойство = СвойстваХарактеристикОткрытаяЦена.ПЛ_НомерЧека_ОткрытаяЦена_Характеристика;
			ДопРеквизит.Значение = НомерЧека;
			
			ДопРеквизит = Новая.ДополнительныеРеквизиты.Добавить();
			ДопРеквизит.Свойство = СвойстваХарактеристикОткрытаяЦена.ПЛ_НомерСтроки_ОткрытаяЦена_Характеристика;
			ДопРеквизит.Значение = Выборка.НомерСтроки;
			
			Новая.Записать();
			Характеристика = Новая.Ссылка;
		КонецЕсли; 
		
		ТекСтрока = ЧекОбъект.Товары[Выборка.НомерСтроки - 1];
		ТекСтрока.Характеристика = Характеристика;
	КонецЦикла;
	
КонецПроцедуры //>> Портал-Юг, Баринов, 2019.09.14

//<< Портал-Юг, Баринов, 2019.04.04 [6.2.23 Функционал установки ссылочных типов в местах где указан код]
Процедура ОбработатьПолеШапкиЧека(Поле, ВыборкаШапка, ЧекОбъект, СопоставлениеЗавершено, НовыеЗаписиСоответствий)
	
	ЗначениеСоответствия = ВыборкаШапка[Поле.Ключ + "Соответствие"];
	Если НЕ ЗначениеЗаполнено(ВыборкаШапка[Поле.Ключ]) И ЗначениеЗаполнено(ЗначениеСоответствия) Тогда
		ЧекОбъект = ЧекОбъект(ВыборкаШапка.ЧекСсылка, ЧекОбъект);
		ЧекОбъект[Поле.Ключ] = ЗначениеСоответствия;		
	ИначеЕсли НЕ ЗначениеЗаполнено(ВыборкаШапка[Поле.Ключ]) И ЗначениеЗаполнено(Поле.Значение) Тогда 
		// Поле осталось незаполнено, но для этого поля есть код соответствия
		Если НЕ ПустаяСтрока(ВыборкаШапка[Поле.Ключ + "Код"]) И НЕ ВыборкаШапка[Поле.Ключ + "НеВлияетНаУчетТМЦ"] Тогда 
			// Есть код, и не установлен флаг "Не влияет на учет ТМЦ" в строке соответствия
			СопоставлениеЗавершено = Ложь;
		КонецЕсли;				
	КонецЕсли;
	
	ПроверитьЗаписьСоответствия(Поле, ВыборкаШапка, НовыеЗаписиСоответствий);
		
КонецПроцедуры //>> Портал-Юг, Баринов, 2019.04.04

//<< Портал-Юг, Баринов, 2019.04.02 [6.2.23 Функционал установки ссылочных типов в местах где указан код]
Процедура ДобавитьЗаписи(НовыеЗаписиСоответствий)
	
	НовыеЗаписиСоответствий.Свернуть("Код, ФронтСистема, ТипОбъекта");
	
	Для каждого НоваяЗапись Из НовыеЗаписиСоответствий Цикл
	
		МенеджерЗаписи = СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, НоваяЗапись);
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
КонецПроцедуры //>> Портал-Юг, Баринов, 2019.04.02

#КонецОбласти
	
#КонецЕсли
